---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.SurfaceId
source: html/d2b7e18e-f572-75f7-ce9e-5a8e16794a23.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.SurfaceId Property

The unique identifier for the surface.

## Syntax (C#)
```csharp
public string SurfaceId { get; }
```

## Remarks
This identification attribute is composed of the prefix "su"
 and a sequential number, separated by "-". A sample value would
 be "su-1".